In [4]:
%load_ext sql
%sql mysql+mysqlconnector://root:viswaa@localhost

In [6]:
%%sql
use practice

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [11]:
%%sql
drop table if exists student;

create table student (
    student_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50) NOT NULL,
    grade_per DECIMAL(5,2) CHECK (grade_per > 0 AND grade_per <= 100),
    staff_id INT,
    FOREIGN KEY (staff_id) REFERENCES staff(staff_id)
);

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql 
select * from student

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(101, 'Vikram', 'Singh', 'Computer Science', Decimal('85.50'), 1, 0),
 (102, 'Anjali', 'Rao', 'Electronics', Decimal('92.30'), 2, 0),
 (103, 'Karthik', 'Menon', 'Mechanical', Decimal('76.80'), 3, 1),
 (104, 'Priya', 'Das', 'Civil', Decimal('88.25'), 4, 0),
 (105, 'Rahul', 'Verma', 'Electrical', Decimal('67.40'), 5, 0),
 (106, 'Sneha', 'Gupta', 'Computer Science', Decimal('94.10'), 1, 0),
 (107, 'Deepak', 'Nair', 'Mechanical', Decimal('81.75'), 3, 1),
 (108, 'Aishwarya', 'Pillai', 'Electronics', Decimal('73.20'), 2, 0),
 (109, 'Rohan', 'Shah', 'Civil', Decimal('65.90'), 4, 0),
 (110, 'Neha', 'Jain', 'Electrical', Decimal('89.60'), 5, 0)]

In [8]:
%%sql
desc student

 * mysql+mysqlconnector://root:***@localhost
7 rows affected.

[('student_id', 'int', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(50)', 'NO', '', None, ''),
 ('last_name', 'varchar(50)', 'NO', '', None, ''),
 ('department', 'varchar(50)', 'NO', '', None, ''),
 ('grade_per', 'decimal(5,2)', 'YES', '', None, ''),
 ('staff_id', 'int', 'YES', 'MUL', None, ''),
 ('is_delete', 'tinyint(1)', 'YES', '', '0', '')]

In [7]:
%%sql
create table staff(
    staff_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50) NOT NULL
)

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [14]:
%%sql
insert into staff (staff_id, first_name, last_name, department) values
(1, 'Ravi', 'Kumar', 'Computer Science'),
(2, 'Meena', 'Sharma', 'Electronics'),
(3, 'Arun', 'Patel', 'Mechanical'),
(4, 'Sita', 'Iyer', 'Civil'),
(5, 'John', 'Mathew', 'Electrical');

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[]

In [15]:
%%sql
insert into student (student_id, first_name, last_name, department, grade_per, staff_id) values
(101, 'Vikram', 'Singh', 'Computer Science', 85.50, 1),
(102, 'Anjali', 'Rao', 'Electronics', 92.30, 2),
(103, 'Karthik', 'Menon', 'Mechanical', 76.80, 3),
(104, 'Priya', 'Das', 'Civil', 88.25, 4),
(105, 'Rahul', 'Verma', 'Electrical', 67.40, 5),
(106, 'Sneha', 'Gupta', 'Computer Science', 94.10, 1),
(107, 'Deepak', 'Nair', 'Mechanical', 81.75, 3),
(108, 'Aishwarya', 'Pillai', 'Electronics', 73.20, 2),
(109, 'Rohan', 'Shah', 'Civil', 65.90, 4),
(110, 'Neha', 'Jain', 'Electrical', 89.60, 5);

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[]

In [21]:
%%sql
select * from student;

 * mysql+mysqlconnector://root:***@localhost
10 rows affected.

[(101, 'Vikram', 'Singh', 'Computer Science', Decimal('85.50'), 1, 0),
 (102, 'Anjali', 'Rao', 'Electronics', Decimal('92.30'), 2, 0),
 (103, 'Karthik', 'Menon', 'Mechanical', Decimal('76.80'), 3, 1),
 (104, 'Priya', 'Das', 'Civil', Decimal('88.25'), 4, 0),
 (105, 'Rahul', 'Verma', 'Electrical', Decimal('67.40'), 5, 0),
 (106, 'Sneha', 'Gupta', 'Computer Science', Decimal('94.10'), 1, 0),
 (107, 'Deepak', 'Nair', 'Mechanical', Decimal('81.75'), 3, 1),
 (108, 'Aishwarya', 'Pillai', 'Electronics', Decimal('73.20'), 2, 0),
 (109, 'Rohan', 'Shah', 'Civil', Decimal('65.90'), 4, 0),
 (110, 'Neha', 'Jain', 'Electrical', Decimal('89.60'), 5, 0)]

In [9]:
%%sql
select * from staff;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[(1, 'Ravi', 'Kumar', 'Computer Science'),
 (2, 'Meena', 'Sharma', 'Electronics'),
 (3, 'Arun', 'Patel', 'Mechanical'),
 (4, 'Sita', 'Iyer', 'Civil'),
 (5, 'John', 'Mathew', 'Electrical')]

In [18]:
%%sql
alter table student add column is_delete boolean default false

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [20]:
%%sql
update student set is_delete = true where staff_id = 3

 * mysql+mysqlconnector://root:***@localhost
2 rows affected.

[]